In [2]:
import pandas as pd
customerData = pd.read_csv("../dataset/kopo_customerdata.csv")
customerTotalList = customerData["TOTAL_AMOUNT"].tolist()

In [1]:
a=[1,3,4,5,6]
del a[len]

IndexError: list assignment index out of range

In [6]:
a=10
b=[]
for i in range(10):
    if i % 3 ==0:
        b.append(i)
print(b)

[0, 3, 6, 9]

In [7]:
#현재 시간과 분을 입력값으로 받아서
#두개의 값을 더하는 연산을 수행하세요

In [8]:
import datetime as dt

In [14]:
import datetime as dt
current_time = dt.datetime.now()
hour = current_time.hour
minute = current_time.minute
sum_time = hour + minute
print(current_time)
print(sum_time)

2021-03-09 17:45:09.390206
62

In [15]:
a="apple_peach"
a.replace('p','t')

'attle_teach'

"SEC 20180212 250" 문자열 생성 후 stock_name, date, value로 각각 의미하는 문자열을 생성하세요

In [26]:
stock_data = "SEC 20180212 250"
stocksplit = stock_data.split(" ")
print(stocksplit)

['SEC', '20180212', '250']

In [27]:
stockname = stocksplit[0]
date = stocksplit[1] 
value = stocksplit[2]

In [28]:
print(stockname,date,value)

SEC 20180212 250

In [29]:
print(stockname)

SEC

In [30]:
print(stock_data[0])

S

“Sec 2018W28 250” 문자열 생성 후 stock_name, date, value로 각각 의미하는 문자열을 생성하세요 (단 모두 대문자여야 하며, ‘W’를 삭제해야함)

In [41]:
Stock = "Sec 2018W28 250"
stockdata = Stock.split(" ")
stock_name = stockdata[0]
date = stockdata[1]
value = stockdata[2]
print(stock_name.upper())
print(date.replace("W",""))
print(value.upper())
date1=date.replace("W","")
print(date1)

SEC
201828
250
201828

In [42]:
test = 'mylove_onyu'
splitter = "_"
result = test.split(splitter)

In [43]:
result

['mylove', 'onyu']

In [44]:
result.remove('onyu')

In [45]:
result

['mylove']

In [46]:
result.append("onyu")

In [47]:
result

['mylove', 'onyu']

In [49]:
del result[0]

In [50]:
result

['onyu']

[120,150,300,500,1000,100,2000] 값에서 최소 최대 값을 뺀 평균을 average 이름의 변수에 담으세요

In [52]:
test = [120,150,300,500,1000,100,2000]
test.remove(max(test))
test.remove(min(test))
print(test)
print(sum(test)/len(test))

[120, 150, 300, 500, 1000]
414.0

In [53]:
a=[1,2,5,33,3,6454]
a_min = a.index(min(a))

In [54]:
a_min

0

In [56]:
del a[a_min]

In [57]:
a

[2, 5, 33, 3, 6454]

In [58]:
a.remove(3)

In [59]:
a

[2, 5, 33, 6454]

In [60]:
del a[0]

In [61]:
a

[5, 33, 6454]

dic = {"name":"sec","id":"300000","address":"suwon"} 에서 id 키 값을 삭제하여 출력하세요{'name': 'sec', 'address': 'suwon’}

In [63]:
dic = {"name":"sec","id":"300000","address":"suwon"}
print(dic.keys())

dict_keys(['name', 'id', 'address'])

In [64]:
dic.pop("id")

'300000'

In [65]:
dic

{'name': 'sec', 'address': 'suwon'}

In [66]:
import pandas as pd

In [69]:
data = {"name":["onyu","lee","kim"],
       "age" : [30,54,10],
       "region" : ["seoul","suwon","masan"]}

In [70]:
pd.DataFrame(data)

   name  age region
0  onyu   30  seoul
1   lee   54  suwon
2   kim   10  masan

In [71]:
import pandas as pd
data = {"name":["lee","kin","park"],
       "age":[34,55,2],
       "region":["seoul","suwon","kimhae"]}

In [78]:
data1 = pd.DataFrame(data)
data1

   name  age  region
0   lee   34   seoul
1   kin   55   suwon
2  park    2  kimhae

In [80]:
data1.columns = ["name1","age1","region1"]
data1

  name1  age1 region1
0   lee    34   seoul
1   kin    55   suwon
2  park     2  kimhae

In [81]:
tvList = [ "UN40EN001", "UN40EN002",\
          "UN40EN003", "UN40EN004" ]

preFix = "LEDTV_"

In [82]:
for i in range(1,4,1):
     tvList = preFix+tvList[i]

In [83]:
tvList

'LEDTV_T'

In [2]:
n,x = map(int,input().split())
a = list(map(int,input().split()))

 5 6
 3

In [4]:
print(n)

5

In [5]:
print(x)

6

In [6]:
print(a)

[3]

In [7]:
for i in range(n)

SyntaxError: invalid syntax (<ipython-input-7-d6a46176cc43>, line 1)

In [9]:
tv = ["Ledtv_0001","LedtvLedtv_0002","0003"]
pre = "Ledtv"
for i in range(3):
    count = tv[i].count(pre)
    if (count == 2):
        tv[i] = tv[i].replace(pre,"")
        tv[i] = pre + tv[i]
    elif (count == 1):
        pass
    else:
        tv[i] = pre + tv[i]

In [10]:
tv

['Ledtv_0001', 'Ledtv_0002', 'Ledtv0003']

In [17]:
import datetime as dt
current_time = dt.datetime.now()
minute = current_time.minute
hour = current_time.hour
print(current_time)
print(hour)
print(minute)

2021-03-15 14:45:27.479962
14
45

In [21]:
print("현재시간은 : {}  \n현재 분은 : {}".format(hour,minute))

현재시간은 : 14
현재 분은 : 45